@extends('layout')
@section('title','เพิ่มเอกสารมคอ3')
@section('content')

<br><br><a href="{{ route('tqf3.index') }}" class="btn btn-danger"> ย้อนกลับ </a><br><br>

<h1>เพิ่มเอกสารมคอ3.</h1><br>

    <form method="POST" action="{{ route('tqf3.update',['tqf3' => $tqf3->id])}}" enctype="multipart/form-data">
        @csrf
        @method('PUT')
 
        <h1><label>หมวดที่ 1 ข้อมูลโดยทั่วไป</label></h1>
        <p>
            <label>1. รหัสวิชาและชื่อรายวิชา</label>
            <input type="text" value="{{ old('name', $tqf3->subject->subjectid) }}"  readonly/>
            <input type="text" value="{{ old('name', $tqf3->subject->subjectnameth) }}"  readonly/>
            <input type="text" value="{{ old('name', $tqf3->subject->subjectnameen) }}" readonly/>
        </p>

        <p>
            <label>2. จำนวนหน่วยกิต</label>
            <input type="text" value="{{ old('name', $tqf3->subject->credit)}}" readonly/>
        </p>

        <p>
            <label>3. หลักสูตรและประเภทวิชา</label>
            <input type="text" />
            <label>หลักสูตร</label>
            <input type="text" />
            <label>สาขาวิชา</label>
            <input type="text" /><br>
            <label>ประเภทกลุ่มรายวิชา</label>
            <input type="text" value="{{ old('name', $tqf3->subject->id)}}"  readonly/>
        </p>

        <p>
            <label>4. อาจารย์ผู้ประสานรายวิชา</label>
            <input type="text" />
            <label>สถานที่ติดต่ออาจารย์ ห้อง IT-302 โทร</label>
            <input type="text" />
            <label>E-mail</label>
            <input type="text" />
        </p>

        <p>
            <label>5. ภาคการศึกษาที่</label>
            <input type="text" value="{{ old('year', $tqf3->year) }} / {{ old('term', $tqf3->term) }}" readonly/>
            <label>ชั้นปีที่</label>
            <input type="text" />
        </p>

        <p>
            <label>6. รายวิชาที่ต้องเรียนมาก่อน (Pre-requisite) (ถ้ามี) ไม่มี</label>
            <input type="text" />
        </p>

        <p>
            <label>7. รายวิชาที่ต้องเรียนพร้อมกัน (Co-requisite) (ถ้ามี) ไม่มี</label>
            <input type="text" />
        </p>

        <p>
            <label>8. สถาที่เรียน คณะวิทยาการสารสนเทศ มหาวิทยาลัยมหาสารคาม</label>
            <label>ห้อง</label>
            <input type="text" />
            <label>วัน</label>
            <input type="text" />
            <label>เวลา</label>
            <input type="text" />
        </p>

        <p>
            <label>9. วันที่จัดทำหรือปรับปรุงรายละเอียดของวิชาครั้งล่าสุด</label>
            <label>วันที่</label>
            <input type="text" />
        </p>

        <h1><label>หมวดที่ 2 จุดมุ่งหมายและวัตถุประสงค์</label></h1>
        <p>
            <label>1.จุดมุ่งหมายของรายวิชา</label>
            <label>1.1</label>
            <input type="text" />
            <label>1.2</label>
            <input type="text" />
        </p>

        <p>
            <label>2.วัตถุประสงค์ในการพัฒนาปรับปรุงรายวิชา</label><br>
            <label>อธิบายโดยย่อเกี่ยวกับวัตถุประสงค์ในการพัฒนารายวิชานี้หรือการเปลี่ยนแปลงสำคัญๆที่เกิดขึ้น 
                <br>เช่น เพิ่มการใช้เทคโนโลยีสารสนเทศ หรือ web based การเปลี่ยนแปลงเนื้อหาของรายวิชาซึ่งเป็นผลจากงานวิจัย ใหม่ๆ ในสาขา</label><br>
            <label>2.1</label>
            <input type="text" /><br>
            <label>2.2</label>
            <input type="text" />
        </p>

        <h1><label>หมวดที่ 3 ลักษณะและการดำเนินการ</label></h1>
        <p>
            <label>1.คำอธิบายรายวิชา</label>
            <input type="text" />
        </p>

        <p>
            <label>2.จำนวนชั่วโมงที่ใช้ต่อภาคการศึกษา</label>
            <label>บรรยาย</label>
            <input type="text" />
            <label>สอนเสริม</label>
            <input type="text" />
            <label>การฝึกปฏิบัติ</label>
            <input type="text" />
            <label>การศึกษาด้วยตนเอง</label>
            <input type="text" />
        </p>

        <p>
            <label>3.จำนวนชั่วโมงต่อสัปดาร์ที่อาจารย์ให้คำปรึกษาแนะนำทางวิชาการแก่นิสิตเป็นรายงานบุคคล</label>

            <input type="tex" placeholder="ระบุจำนวนชั่วโมงต่อสัปดาห์ที่จะให้คำปรึกษาและแนะนำทางวิชาการแก่นักศึกษานอกชั้นเรียนและระบุวิธีการสื่อสารให้นักศึกษาได้ทราบกำหนดเวลาล่วงหน้า"  
            size="150"/>
        </p>

        <p>
            <label>4.การบูรณาการเรียนการสอนกับงานวิจัย / งานบริการวิชาการ / ทำนุบำรุงศิลปะ (ถ้ามี)</label>
            <input type="text" />
        </p>

        <h1>หมวดที่ 4 การพัฒนาการเรียนรู้ของนิสิต</h1>
        <p>
            <label>1.คุณธรรม จริยธรรม</label><br>
            <label>1.1 คุณธรรม จริยธรรมที่ต้องพัฒนา</label><br>

            <label> 
                @foreach ($tqf3->subject->sics as $sic)
                    @if ($sic->resp11 == 1)
                    1.1) คระหนักในคุณค่าและคุณธรรม จริยธรรม เสียสละ และซื่อสัตย์สุจริต <br>  
                    {{-- @elseif ($sic->resp11 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp12 == 1)
                    1.2) มีวินัย ตรงต่อเวลา และความรับผิดชอบต่อตนเองและสังคม <br>
                    {{-- @elseif ($sic->resp12 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp13 == 1)
                    1.3) มีภาวะความเป็นผู้นำและผู้ตาม สามารถทำงานเป็นทีมและสามารถแก้ไขข้อขัดแย้งและลำดับความสำคัญ<br>
                    {{-- @elseif ($sic->resp13 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp14 == 1)
                    1.4) เคารพสิทธิและรับฟังความคิดเห็นของผู้อื่น รวมทั้งเคารพในคุณค่าและศักดิ์ศรีของความเป็นมนุษย์<br>
                    {{-- @elseif ($sic->resp14 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp15 == 1)
                    1.5) เคารพกฎระเบียบและข้อบังคับต่าง ๆ ขององค์กรและสังคม<br>
                    {{-- @elseif ($sic->resp15 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp16 == 1)
                    1.6) สามารถวิเคราะห์ผลกระทบจากการใช้คอมพิวเตอร์ต่อบุคคลองค์กรและสังคม<br>
                    {{-- @elseif ($sic->resp16 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp17 == 1)
                    1.7) มีจรรยาบรรณทางวิชาการและวิชาชีพ<br>
                    {{-- @elseif ($sic->resp17 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                @endforeach
                {{-- {{ $tqf3->subject->sics as sic}} --}}
            </label><br>


            <label>1.2 วิธีการสอน</label><br>
            <textarea name="description12" rows="5" cols="4" class="form-control"></textarea><br>

            <label>1.3 วิธีการประเมินผล</label><br>
            <textarea name="description13" rows="5" cols="4" class="form-control"></textarea><br>
        </p>

        <p>
            <label>2.ความรู้</label><br>
            <label>2.1 ความรู้ต้องพัฒนา </label><br>
            <label> 
                @foreach ($tqf3->subject->sics as $sic)
                    @if ($sic->resp21 == 1)
                    2.1) มีความรู้และความเช้าใจเกี่ยวกับหลักการและทฤษฏีที่สำคัญในเนื้อหาที่สาขาวิชาเทคโนโลยีสารสนเทศ<br>
                    {{-- @elseif ($sic->resp21 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp22 == 1)
                    2.2) สามารถวิเคราะห์ปัญหา เข้าใจและอธิบายความต้องการทางคอมพิวเตอร์ รวมทั้งประยุกต์ความรู้ ทักษะ และการใช้เครื่องมือที่เหมาะสมกับการแก้ไขปัญหา<br>
                    {{-- @elseif ($sic->resp22 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp23 == 1)
                    2.3) สามารถวิเคราะห์ ออกแบบ ติดตั้ง ปรับปรุงและ/หรือประเมินระบบองค์ประกอบต่างๆของระบบเทคโนโลยีสารสนเทศให้ตรงตามข้อกำหนด<br>
                    {{-- @elseif ($sic->resp23 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp24 == 1)
                    2.4) สามารถติดตามความก้าวหน้าทางวิชาการและวิวัฒนาการคอมพิวเตอร์<br>
                    {{-- @elseif ($sic->resp24 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp25 == 1)
                    2.5) รู้ เข้าใจและสนใจพัฒนาความรู้ ความชำนาญทางคอมพิวเคอร์อย่างต่อเนื่อง<br>
                    {{-- @elseif ($sic->resp25 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp26 == 1)
                    2.6) มีความรู้ในแนวกว้างของสาขาวิชาที่ศึกษาเพื่อให้เล็งเห็นการเปลี่ยนแปลง และเข้าใจผลกระทบของเทคโนโลยีใหม่ๆ<br>
                    {{-- @elseif ($sic->resp26 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp27 == 1)
                    2.7) มีประสบการณ์ในการพัฒนาและ/หรือประยุกต์ซอฟด์แวร์ที่ใช้งานได้จริง<br>
                    {{-- @elseif ($sic->resp27 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp28 == 1)
                    2.8) สามารภบูรณาการความรู้ในสาขาวิชาเทคโนโลยีสารสนเทศกับความรู้ในศาสตร์อื่น ๆ ที่เกี่ยวข้อง<br>
                    {{-- @elseif ($sic->resp28 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif
                    
                @endforeach
            </label><br>

            <label>2.2 วิธีการสอน</label><br>
            <input type="text" /><br>

            <label>2.3 วิธีการประเมินผล</label><br>
            <input type="text" />
        </p>

        <p>
            <label>3.ทักษะทางปัญญา</label><br>
            <label>3.1 ทักษะทางปัญญาที่ต้องพัฒนา</label><br>

            <label> 
                @foreach ($tqf3->subject->sics as $sic)
                    @if ($sic->resp31 == 1)
                    3.1) คิดอย่างมีวิจารณญาณและอย่างเป็นระบบ<br>
                    {{-- @elseif ($sic->resp31 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp32 == 1)
                    3.2) สามารถสือค้น ตีความ และประเมินสารสนเทศ เพื่อใช้ในการแก้ไขปัญหาอย่างสร้างสรรค์<br>
                    {{-- @elseif ($sic->resp32 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp33 == 1)
                    3.3) สามารถรวบรวม ศึกษา วิเตาระห์ และสรุปประเด็นปัญหาและความต้องการ<br>
                    {{-- @elseif ($sic->resp33 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp34 == 1)
                    3.4) สามารถประยุกต์ความรู้และทักษาะกับการแก้ไขทางคอมพิวเตอร์ได้อย่างเหมาะสม<br>
                    {{-- @elseif ($sic->resp34 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif
                    
                @endforeach
            </label><br>


            <label>3.2 วิธีการสอน</label><br>
            <input type="text" /><br>

            <label>3.3 วิธีการประเมินผล</label><br>
            <input type="text" />
        </p>

        <p>
            <label>4.ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ</label><br>
            <label>4.1 ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบที่ต้องพัฒนา</label><br>
            <label> 
                @foreach ($tqf3->subject->sics as $sic)
                    @if ($sic->resp41 == 1)
                    4.1) สามาถสื่อสารทั้งภาษาไทยและภาษาต่างประเทศกับกลุ่มคนหลากหลายได้อย่างมีประสิทธิภาพ<br>
                    {{-- @elseif ($sic->resp41 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp42 == 1)
                    4.2) สามารถให้ความช่วยเหลือและอำนวยความสะดวกในการแก้ปัญหาสภานการณ์ต่าง ๆ ทั้งในบทบาทผู้นำ หรือในบทบาทของผู้ร่วมทีมทำงาน<br>
                    {{-- @elseif ($sic->resp42 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp43 == 1)
                    4.3) สามารถใช้ความรู้ในศาสตร์มาชี้นำสังคมในประเด็นที่เหมาะสม<br>
                    {{-- @elseif ($sic->resp43 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp44 == 1)
                    4.4) มีความรับผิดชอบในการกระทำของตนเองและรับผิดชอบงานในกลุ่ม<br>
                    {{-- @elseif ($sic->resp44 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp45 == 1)
                    4.5) สามารถเป็นผู้ริเริ่มแสดงประเด็นในการแก้ไขสถานการณ์ทั้งส่วนตัวและส่วนรวม พร้อมทั้งแสดงจุดยืนอย่างพอเหมาะทั้งของตนเองและของกลุ่ม<br>
                    {{-- @elseif ($sic->resp45 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp46 == 1)
                    4.6) มีความรับผิดชอบการพัฒนาการเรียนรู้ทั้งของตนเองและทางวิชาชีพอย่างต่อเนื่อง<br>
                    {{-- @elseif ($sic->resp46 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif
                    
                @endforeach
            </label><br>
            


            <label>4.2 วิธีการสอน</label><br>
            <input type="text" /><br>

            <label>4.3 วิธีการประเมินผล</label><br>
            <input type="text" />
        </p>

        <p>
            <label>5.ทักษะการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศที่ต้องพัฒนา</label><br>
            <label>5.1 ทักษะการสื่อสารและการใช้เทคโนโลยีสารสนเทศที่ต้องพัฒนา</label><br>

            <label> 
                @foreach ($tqf3->subject->sics as $sic)
                    @if ($sic->resp51 == 1)
                    5.1) มีทักษะในการใช้เครื่องมือที่จำเป็นที่มีอยู่ในปัจจุบันต่อการทำงานที่เกี่ยวกับคอมพิวเตอร์<br>
                    {{-- @elseif ($sic->resp51 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp52 == 1)
                    5.2) สามารถแนะนำประเด็นการแก้ไขโดยใช้สารสนเทศทางคณิตศาสตร์หรือการแสดงสถิติประยุกต์ต่อปัญหาที่เกี่ยวข้องอย่างสร้างสรรค์<br>
                    {{-- @elseif ($sic->resp52 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp53 == 1)
                    5.3) สามารถสื่อสารอย่างมีประสิทธิภาพทั้งปากเปล่าและการเขียน พร้อมทั้งลือกใช้รูปแบบของสื่อการนำเสนอได้อย่างเหมาะสม<br>
                    {{-- @elseif ($sic->resp53 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif

                    @if ($sic->resp54 == 1)
                    5.4) สามารภใช้เทคโนโลยีสารสนเทศได้อย่างเหมาะสม<br>
                    {{-- @elseif ($sic->resp54 == 2)
                        ความรับผิดชอบรอง
                    @else
                        ไม่มี --}}
                    @endif
                    
                @endforeach
            </label><br>

            <label>5.2 วิธีการสอน</label><br>
            <input type="text" /><br>

            <label>5.3 วิธีการประเมินผล</label><br>
            <input type="text" />
        </p>

        <h1>หมวดที่ 5 แผนการสอนและการประเมินผล</h1>
        <p>
            <label>1.แผนการสอน</label><br>
            <input type="text" />
        </p>

        <p>
            <label>2.แผนการประเมินผลการเรียนรู้</label><br>
            <label>2.1 วิธีการ</label><br>
            <label>2.2 เกณฑ์ผ่านรายวิชา ผู้ที่จะผ่านรายวิชานี้จะต้อง</label><br>
            <input type="text" /><br>
            <label>2.3 เกณฑ์ค่าระดับคะแนน</label><br>
            <input type="text" />
        </p>

        <h1>หมวดที่ 6 ทรัพยากรประกอบการเรียนการสอน</h1>
        <p>
            <label>1.เอกสารและตำราหลัก</label><br>
            <input type="text" placeholder="ระบุตำราและเอกสารหลักที่ใช้ในการเรียนการสอน" size="150"/>
        </p>

        <p>
            <label>2.เอกสารและข้อมูลสำคัญ</label><br>
            <input type="text" placeholder="ระบุหนังสือ วารสาร รายงาน สื่ออิเล็กทรอนิกส์ เว็บไซต์ กฎระเบียบต่างๆ โปรแกรมคอมพิวเตอร์และแหล่งอ้างอิงที่สำคัญอื่นๆ ซึ่งนักศึกษาจำเป็นต้องศึกษาเพิ่มเติม" size="150"/>
        </p>

        <p>
            <label>3.เอกสารและข้อมูลแนะนำ</label><br>
            <input type="text" placeholder="ระบุหนังสือ วารสาร รายงาน สื่ออิเล็กทรอนิกส์ เว็บไซต์ กฎระเบียบต่างๆ โปรแกรมคอมพิวเตอร์และแหล่งอ้างอิงที่สำคัญอื่นๆ ซึ่งนักศึกษาควรศึกษาเพิ่มเติม" size="150"/>
        </p>

        <h1>หมวดที่ 7 การประเมินและปรับปรุงการดำเนินการของรายวิชา</h1>
        <p>
            <label>1.กลยุทธ์การประเมินประสิทธิผลของรายวิชาโดยนิสิต</label><br>
            <input type="text" />
        </p>

        <p>
            <label>2.กลยุทธ์การประเมินการสอน</label><br>
            <input type="text" placeholder="ระบุวิธีการประเมินที่จะได้ข้อมูลการสอน เช่น จากผู้สังเกตการณ์ หรือทีมผู้สอน หรือผลการเรียนของนักศึกษา เป็นต้น" size="150" />
        </p>

        <p>
            <label>3.การปรับปรุงการสอน</label><br>
            <input type="text" placeholder="อธิบายการปรับปรุงการสอน เช่น การวิจัยในชั้นเรียน การประชุมเชิงปฏิบัติการเพื่อพัฒนาการเรียนการสอน เป็นต้น" size="150" />
        </p>

        <p>
            <label>4.การทวนสอบมาตรฐานผลสัมฤทธิ์ของนิสิตในรายวิชา</label><br>
            <input type="text" placeholder="อธิบายกระบวนการที่ใช้ในการทวนสอบมาตรฐานผลสัมฤทธิ์ของนักศึกษาตามมาตรฐานผลการเรียนรู้ของรายวิชา เช่น ทวนสอบจากคะแนนข้อสอบ หรืองานที่มอบหมาย กระบวนการอาจแตกต่างกันไปสำหรับรายวิชาที่แตกต่างกัน หรือสำหรับมาตรฐานผลการเรียนรู้แต่ละด้าน" size="200" />
        </p>

        <p>
            <label>5.การดำเนินการทบทวนและการวางแผนปรับปรุงประสิทธิผลของรายวิชา</label><br>
            <input type="text" placeholder="อธิบายกระบวนการในการนำข้อมูลที่ได้จากการประเมินจากข้อ 1 และ 2 มาวางแผนเพื่อปรับปรุงคุณภาพ" size="100"/>
        </p>

        @if ($errors->any())
            <div>
                <ul>
                    @foreach ($errors->all() as $error)
                        <li>{{ $error }}</li>
                    @endforeach
                </ul>
            </div>
        @endif 

        <button type="submit" class="btn btn-primary btn-block">Create!</button>
    </form>

@endsection